#### Terraform Format and Style 🖌``
#### Terraform Initialization `success`
#### Terraform Plan `success`
#### Terraform Validation ``
<details><summary>Show Plan</summary>
```

terraform
module.sa.google_project_service.project: Refreshing state... [id=custom-valve-332208/iam.googleapis.com]
module.vpc2.google_compute_network.vpc_network: Refreshing state... [id=projects/custom-valve-332208/global/networks/terraform-networkss]
module.vpc2.google_compute_subnetwork.public-subnetwork: Refreshing state... [id=projects/custom-valve-332208/regions/europe-west1/subnetworks/terraform-subnetworks]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.gce.google_compute_address.gce_static_ip will be created
  + resource "google_compute_address" "gce_static_ip" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "kylo-ren-ext-ip-tf-2"
      + network_tier       = (known after apply)
      + project            = (known after apply)
      + purpose            = (known after apply)
      + region             = "europe-west1"
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + users              = (known after apply)

      + timeouts {
          + create = "5m"
          + delete = "5m"
        }
    }

  # module.gce.google_compute_instance.gce will be created
  + resource "google_compute_instance" "gce" {
      + allow_stopping_for_update = false
      + can_ip_forward            = false
      + cpu_platform              = (known after apply)
      + current_status            = (known after apply)
      + deletion_protection       = false
      + guest_accelerator         = (known after apply)
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + label_fingerprint         = (known after apply)
      + machine_type              = "e2-medium"
      + metadata_fingerprint      = (known after apply)
      + metadata_startup_script   = <<-EOT
            #!/bin/sh
            
            sudo google_metadata_script_runner --script-type startup
            sudo apt update -y; sudo apt install apt-transport-https ca-certificates curl software-properties-common -y
            sudo apt install nginx -y
            sudo ufw allow 'Nginx HTTP'
        EOT
      + min_cpu_platform          = (known after apply)
      + name                      = "kylo-ren-tf-2"
      + project                   = "custom-valve-332208"
      + self_link                 = (known after apply)
      + tags                      = [
          + "http-server",
          + "https-server",
        ]
      + tags_fingerprint          = (known after apply)
      + zone                      = "europe-west1-b"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "ubuntu-1804-lts"
              + labels = (known after apply)
              + size   = 50
              + type   = "pd-standard"
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      + network_interface {
          + name               = (known after apply)
          + network            = "default"
          + network_ip         = (known after apply)
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = "PREMIUM"
            }
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + min_node_cpus       = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }

      + service_account {
          + email  = (known after apply)
          + scopes = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
        }

      + timeouts {
          + create = "25m"
          + delete = "25m"
          + update = "25m"
        }
    }

  # module.gce.google_project_iam_member.spanner_role will be created
  + resource "google_project_iam_member" "spanner_role" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/spanner.viewer"
    }

  # module.gce.google_project_service.compute_api will be created
  + resource "google_project_service" "compute_api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "compute.googleapis.com"
    }

  # module.gce.google_project_service.networking_api will be created
  + resource "google_project_service" "networking_api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "servicenetworking.googleapis.com"
    }

  # module.gce.google_service_account.gce_sa will be created
  + resource "google_service_account" "gce_sa" {
      + account_id   = "kylo-ren-sa-tf-2"
      + display_name = "kylo-ren-sa-tf-2"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)

      + timeouts {
          + create = "10m"
        }
    }

  # module.sa.google_project_service.project will be destroyed
  # (because google_project_service.project is not in configuration)
  - resource "google_project_service" "project" {
      - disable_dependent_services = true -> null
      - disable_on_destroy         = true -> null
      - id                         = "custom-valve-332208/iam.googleapis.com" -> null
      - project                    = "custom-valve-332208" -> null
      - service                    = "iam.googleapis.com" -> null
    }

Plan: 6 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @rrajpald, Action: `pull_request`*